Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/hal/sys_hal.c
	switch(id)
	{
		case UART_ID_0:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart0(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart0(sel_xtal);
				break;
			}
		case UART_ID_1:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart1(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart1(sel_xtal);
				break;
			}
		case UART_ID_2:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_xtal);
				break;
			}
#if (SOC_UART_ID_NUM_PER_UNIT  >= 4)
		case UART_ID_3:
			{
				if(mode == UART_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_xtal);
				break;
			}
#endif
		default:
			break;
	}

}

/* I2C select clock **/
void sys_hal_i2c_select_clock(i2c_id_t id, i2c_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_appl = 1;

	switch(id)
	{
		case I2C_ID_0:
			{
				if(mode == I2C_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_i2c0(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_i2c0(sel_xtal);
				break;
			}
#if (SOC_I2C_UNIT_NUM > 1)
		case I2C_ID_1:
			{
				if(mode == I2C_SCLK_APLL)
					sys_ll_set_cpu_clk_div_mode1_cksel_i2c1(sel_appl);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_i2c1(sel_xtal);
				break;
			}
#endif
		default:
			break;
	}

}

void sys_hal_pwm_select_clock(sys_sel_pwm_t num, pwm_src_clk_t mode)
{
	uint32_t sel_clk32 = 0;
	uint32_t sel_xtal = 1;

	switch(num)
	{
		case SYS_SEL_PWM0:
			if(mode == PWM_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(sel_clk32);
			break;
		case SYS_SEL_PWM1:
			if(mode == PWM_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_pwm0(sel_clk32);
			break;

		default:
			break;
	}
}

void sys_hal_timer_select_clock(sys_sel_timer_t num, timer_src_clk_t mode)
{
	uint32_t sel_clk32 = 0;
	uint32_t sel_xtal = 1;

	switch(num)
	{
		case SYS_SEL_TIMER0:
			if(mode == TIMER_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_tim0(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_tim0(sel_clk32);
			break;
		case SYS_SEL_TIMER1:
			if(mode == TIMER_SCLK_XTAL)
				sys_ll_set_cpu_clk_div_mode1_cksel_tim1(sel_xtal);
			else
				sys_ll_set_cpu_clk_div_mode1_cksel_tim1(sel_clk32);
			break;
		default:
			break;
	}
}

uint32_t sys_hal_timer_select_clock_get(sys_sel_timer_t id)
{
	uint32_t ret = 0;

	switch(id)
	{
		case SYS_SEL_TIMER0:
		{
			ret = sys_ll_get_cpu_clk_div_mode1_cksel_tim0();
			break;
		}
		case SYS_SEL_TIMER1:
		{
			ret = sys_ll_get_cpu_clk_div_mode1_cksel_tim1();
			break;
		}
		default:
			break;
	}

	ret = (ret) ? TIMER_SCLK_XTAL : TIMER_SCLK_CLK32;

	return ret;
}

void sys_hal_spi_select_clock(spi_id_t num, spi_src_clk_t mode)
{
	uint32_t sel_xtal = 0;
	uint32_t sel_60m = 1;
	uint32_t sel_80m = 3;

	switch(num)
	{
		case SPI_ID_0:
			if (mode == SPI_CLK_XTAL) {
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(sel_xtal);
			} else if (mode == SPI_CLK_APLL) {
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(sel_60m);
			} else {
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(sel_80m);
			}
			break;
#if (SOC_SPI_UNIT_NUM > 1)
		case SPI_ID_1:
			if (mode == SPI_CLK_XTAL) {
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(sel_xtal);
			} else if (mode == SPI_CLK_APLL) {
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(sel_60m);
			} else {
				sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi1(sel_80m);
			}
			break;
#endif
		default:
			break;
	}
}

void sys_hal_qspi_clk_sel(uint32_t id, uint32_t param)
{
	uint32_t sel_60m = 0;
	uint32_t sel_80m = 1;

	switch(id)
	{
		case QSPI_ID_0:
			if (param == QSPI_SCLK_80M) {
				sys_ll_set_cpu_26m_wdt_clk_div_cksel_qspi1(sel_80m);
			} else {
				sys_ll_set_cpu_26m_wdt_clk_div_cksel_qspi1(sel_60m);
			}
			break;
		default:
			break;
	}
}

void sys_hal_qspi_set_src_clk_div(uint32_t id, uint32_t value)
{
	switch(id)
	{
		case QSPI_ID_0:
			sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_qspi1(value&0x3);
			break;
		default:
			break;
	}
}

void sys_hal_set_clk_select(dev_clk_select_id_t dev, dev_clk_select_t clk_sel)
{
}

dev_clk_select_t sys_hal_get_clk_select(dev_clk_select_id_t dev)
{
	return 0;
}

//DCO divider is valid for all of the peri-devices.
void sys_hal_set_dco_div(dev_clk_dco_div_t div)
{
}

//DCO divider is valid for all of the peri-devices.
dev_clk_dco_div_t sys_hal_get_dco_div(void)
{
	return 0;
}

/*clock power control end*/
void sys_hal_set_cksel_sadc(uint32_t value)
{
}

void sys_hal_set_cksel_pwm0(uint32_t value)
{
}

void sys_hal_set_cksel_pwm1(uint32_t value)
{
}

void sys_hal_set_cksel_pwm(uint32_t value)
{
    sys_hal_set_cksel_pwm0(value);
    sys_hal_set_cksel_pwm1(value);
}

uint32_t sys_hal_uart_select_clock_get(uart_id_t id)
{
    uint32_t ret = 0;

    switch(id)
    {
        case UART_ID_0:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart0();
            break;
        }
        case UART_ID_1:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart1();
            break;
        }
        case UART_ID_2:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart2();
            break;
        }
#if (SOC_UART_ID_NUM_PER_UNIT  >= 4)
        case UART_ID_3:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_uart3();
            break;
        }
#endif
        default:
            break;
    }

    ret = (!ret)?UART_SCLK_XTAL_26M:UART_SCLK_APLL;

    return ret;
}

uint32_t sys_hal_i2c_select_clock_get(i2c_id_t id)
{
    uint32_t ret = 0;

    switch(id)
    {
        case I2C_ID_0:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_i2c0();
            break;
        }
        case I2C_ID_1:
        {
            ret = sys_ll_get_cpu_clk_div_mode1_cksel_i2c1();
            break;
        }
        default:
            break;
    }

    ret = (!ret)?I2C_SCLK_XTAL_26M:I2C_SCLK_APLL;

    return ret;
}

void sys_hal_sadc_int_enable(void)
{
    sys_hal_int_enable(SADC_INTERRUPT_CTRL_BIT);
}

void sys_hal_sadc_int_disable(void)
{
    sys_hal_int_disable(SADC_INTERRUPT_CTRL_BIT);
}

uint32_t sys_hal_sadc_get_int_en(void)
{
    return sys_hal_get_int_en_value(SADC_INTERRUPT_CTRL_BIT);
}
void sys_hal_sadc_pwr_up(void)
{
	sys_ll_set_cpu_device_clk_enable_sadc_cken(1);
}

void sys_hal_sadc_pwr_down(void)
{
	sys_ll_set_cpu_device_clk_enable_sadc_cken(0);
}

void sys_hal_set_saradc_config(void)
{
	/* yanxiang.wei@bekencorp.com, based on doc: bk7236n_v2_gadc register setting.xlms*/
	sys_ana_ll_set_ana_reg2_inbufen(1);
	sys_ana_ll_set_ana_reg2_gadc_calcap_ch(3);
	sys_ana_ll_set_ana_reg2_gadc_clk_inv(1);
	sys_ana_ll_set_ana_reg2_gadc_clk_sel(1);
	sys_ana_ll_set_ana_reg2_gadc_calintsaw_en(1);
	sys_ana_ll_set_ana_reg2_gadc_clk_rlten(1);
	sys_ana_ll_set_ana_reg2_gadc_vbg_sel(1);
	sys_ana_ll_set_ana_reg2_gadc_vpcalsaw(4);
	sys_ana_ll_set_ana_reg2_gadc_vncalsaw(4);
	sys_ana_ll_set_ana_reg2_gadc_bscalsaw(4);
	sys_ana_ll_set_ana_reg2_gadc_compisel(4);
	sys_ana_ll_set_ana_reg2_nc_10_10(1);
	sys_ana_ll_set_ana_reg2_gadc_inbufsel(1);
	sys_ana_ll_set_ana_reg2_sar_enspi(1);

	sys_ana_ll_set_ana_reg3_offset_en(0);
	sys_ana_ll_set_ana_reg3_vref_sel(1);
	sys_ana_ll_set_ana_reg3_refbuff_isel(4);
	sys_ana_ll_set_ana_reg3_preamp_isel(4);
}

void sys_hal_set_sdmadc_config(void)
{
	/*TODO*/
}

void sys_hal_set_clksel_spi0(uint32_t value)
{
    sys_ll_set_cpu_26m_wdt_clk_div_clksel_spi0(value);
}

