Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/hal/sys_hal.c
void sys_hal_mac_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_mac_cken(clk_en);
}



void sys_hal_set_vdd_value(uint32_t param)
{
	sys_hal_ctrl_vdddig_h_vol(param);
}

uint32_t sys_hal_get_vdd_value(void)
{
	return sys_ana_ll_get_ana_reg8_vcorehsel();
}

//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	//TODO 7256 no block en mux
}

__IRAM_SEC void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
}

void sys_hal_enable_mac_gen_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_mac_int_gen_int_en(1);
}

void sys_hal_enable_mac_prot_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_port_trigger_int_en(1);
}

void sys_hal_enable_mac_tx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_trigger_int_en(1);
}

void sys_hal_enable_mac_rx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_rx_trigger_int_en(1);
}

void sys_hal_enable_mac_txrx_misc_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_misc_int_en(1);
}

void sys_hal_enable_mac_txrx_timer_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_timer_int_en(1);
}

void sys_hal_enable_modem_int(void)
{
}

void sys_hal_enable_modem_rc_int(void)
{
}

void sys_hal_enable_hsu_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_hsu_irq_int_en(1);
}

void sys_hal_disable_hsu_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_hsu_irq_int_en(0);
}

//Yantao Add End

__FLASH_BOOT_CODE void sys_hal_cali_dpll_spi_trig_disable(void)
{
	// NOT SUPPORT
}

__FLASH_BOOT_CODE void sys_hal_cali_dpll_spi_trig_enable(void)
{
	// NOT SUPPORT
}

__FLASH_BOOT_CODE void sys_hal_cali_dpll_spi_detect_disable(void)
{
    sys_ana_ll_set_ana_reg1_osccal_trig(0);
}

__FLASH_BOOT_CODE void sys_hal_cali_dpll_spi_detect_enable(void)
{
    sys_ana_ll_set_ana_reg1_osccal_trig(1);
}

void sys_hal_set_xtalh_ctune(uint32_t value)
{
    sys_ana_ll_set_ana_reg2_xtalh_ctune(value);
}

__FLASH_BOOT_CODE void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}
__FLASH_BOOT_CODE uint32_t sys_hal_analog_get(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}
void sys_hal_set_ana_reg1_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg1_value(value);
}

void sys_hal_set_ana_reg2_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg2_value(value);
}

void sys_hal_set_ana_reg3_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg3_value(value);
}

void sys_hal_set_ana_reg4_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg4_value(value);
}

void sys_hal_set_ana_reg12_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg12_value(value);
}

void sys_hal_set_ana_reg13_value(uint32_t value)
{
    //sys_ll_set_ana_reg13_value(value);
}

void sys_hal_set_ana_reg14_value(uint32_t value)
{
    //sys_ll_set_ana_reg14_value(value);
}

void sys_hal_set_ana_reg15_value(uint32_t value)
{
    //sys_ll_set_ana_reg15_value(value);
}

void sys_hal_set_ana_reg16_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg17_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg18_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg19_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg20_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg21_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg27_value(uint32_t value)
{
	// NOT SUPPORT
}

uint32_t sys_hal_bias_reg_read(void)
{
	///TODO
    return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	///TODO

	return 0;

}

uint32_t sys_hal_analog_reg2_get(void)
{
	///TODO

    return 0;
}

uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	///TODO

	return 0;
}

uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	///TODO

	return 0;
}


uint32_t sys_hal_get_xtalh_ctune(void)
{
    return sys_ana_ll_get_ana_reg2_xtalh_ctune();
}

__FLASH_BOOT_CODE uint32_t sys_hal_cali_bgcalm(void)
{
    uint32_t bandgap;

    sys_ana_ll_set_ana_reg8_spi_latch1v(1);
    sys_ana_ll_set_ana_reg7_pwd_bgcal(0);
    sys_ana_ll_set_ana_reg7_vbgcalmode(0);
    sys_ana_ll_set_ana_reg7_vbgcalstart(0);
    sys_ana_ll_set_ana_reg7_vbgcalstart(1);
    delay_us(100); //100us
    sys_ana_ll_set_ana_reg7_vbgcalstart(0);

    delay_us(2000); //2ms to avoid consistency issue

    bandgap = aon_pmu_ll_get_r7d_bgcal();

    sys_ana_ll_set_ana_reg7_vbgcalmode(1);
    sys_ana_ll_set_ana_reg7_pwd_bgcal(1);
    sys_ana_ll_set_ana_reg8_spi_latch1v(0);

    return bandgap;
}

uint32_t sys_hal_get_bgcalm(void)
{
    return sys_ana_ll_get_ana_reg7_bgcal();
}

void sys_hal_set_bgcalm(uint32_t value)
{
    sys_ana_ll_set_ana_reg8_spi_latch1v(1);
    sys_ana_ll_set_ana_reg7_bgcal(value);
    sys_ana_ll_set_ana_reg8_spi_latch1v(0);
}

void sys_hal_set_audioen(uint32_t value)
{
}

void sys_hal_set_dpll_div_cksel(uint32_t value)
{
}

void sys_hal_set_dpll_reset(uint32_t value)
{
}

void sys_hal_set_gadc_ten(uint32_t value)
{
}
/**  WIFI End **/

/**  Audio Start  **/

void sys_hal_aud_select_clock(uint32_t value)
{
}

void sys_hal_aud_clock_en(uint32_t value)
{
}

void sys_hal_aud_mic1_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dacl_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_diffen_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic_rst_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_gain_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dcoc_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_lmdcin_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_adcbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_en(uint32_t value)
{
	// NOT SUPPORT
}

