Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/hal/sys_hal.c
void sys_hal_aud_dac_bias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_idac_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_drv_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_single_en(uint32_t value)
{
}

void sys_hal_aud_mic2_single_en(uint32_t value)
{
}

void sys_hal_aud_int_en(uint32_t value)
{
}

void sys_hal_aud_power_en(uint32_t value)
{
}

void sys_hal_aud_lvcmd_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias1v_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_trim_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audpll_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_dacr_en(uint32_t value)
{
}

void sys_hal_aud_vdd1v_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_vdd1v5_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_mic2_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_mic2_gain_set(uint32_t value)
{
	//not support
}

void sys_hal_aud_dacg_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_aud_en(uint32_t value)
{
	//not support
}

void sys_hal_aud_rvcmd_en(uint32_t value)
{
	//not support
}

void sys_hal_dmic_clk_div_set(uint32_t value)
{
}

void sys_hal_aud_dac_dacmute_en(uint32_t value)
{
	//TODO
}

/**  Audio End  **/

/**  FFT Start  **/

void sys_hal_fft_disckg_set(uint32_t value)
{
}

void sys_hal_cpu_fft_int_en(uint32_t value)
{
}

/**  FFT End  **/

/**  I2S Start  **/
void sys_hal_i2s_select_clock(uint32_t value)
{
}

void sys_hal_i2s_clock_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_i2s_cken(value);
}

void sys_hal_i2s1_clock_en(uint32_t value)
{
}

void sys_hal_i2s2_clock_en(uint32_t value)
{
}

void sys_hal_i2s_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_i2s0_int_en(value);
}

void sys_hal_i2s1_int_en(uint32_t value)
{
}

void sys_hal_i2s2_int_en(uint32_t value)
{
}

void sys_hal_i2s_disckg_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_cb_manu_val_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_ana_reg11_vsel_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_cal_val_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_apll_spi_trigger_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_i2s0_ckdiv_set(uint32_t value)
{
	//NOT SUPPORT
}

void sys_hal_apll_config_set(uint32_t value)
{
	// NOT SUPPORT
}


/**  I2S End  **/


/** jpeg start **/
void sys_hal_set_jpeg_clk_sel(uint32_t value)
{
}

void sys_hal_set_clk_div_mode1_clkdiv_jpeg(uint32_t value)
{
}

void sys_hal_set_jpeg_disckg(uint32_t value)
{
}

void sys_hal_set_cpu_clk_div_mode1_clkdiv_bus(uint32_t value)
{
}

void sys_hal_video_power_en(uint32_t value)
{
}

void sys_hal_set_auxs_cis_clk_sel(uint32_t value)
{
}

void sys_hal_set_auxs_cis_clk_div(uint32_t value)
{
}

void sys_hal_set_jpeg_clk_en(uint32_t value)
{
}

void sys_hal_set_cis_auxs_clk_en(uint32_t value)
{
}

/** jpeg end **/

/** h264 Start **/
void sys_hal_set_h264_clk_en(uint32_t value)
{
}

/** h264 End **/

/**  psram Start **/
__FLASH_BOOT_CODE void sys_hal_psram_volstage_sel(uint32_t enable)
{
	sys_ana_ll_set_ana_reg4_swb(enable); //1-1.8v, 0-3.0v
}

__FLASH_BOOT_CODE void sys_hal_psram_xtall_osc_enable(uint32_t enable)
{
	sys_ana_ll_set_ana_reg5_en_xtall(enable);
}

__FLASH_BOOT_CODE void sys_hal_psram_doc_enable(uint32_t enable)
{
	//sys_ana_ll_set_ana_reg5_nc_2_2(enable);
}

__FLASH_BOOT_CODE void sys_hal_psram_ldo_enable(uint32_t enable)
{
	sys_ana_ll_set_ana_reg4_en_psramldo(enable);
}

__FLASH_BOOT_CODE void sys_hal_psram_dpll_enable(uint32_t enable)
{
	sys_ana_ll_set_ana_reg5_en_dpll(enable);
}

__FLASH_BOOT_CODE void sys_hal_psram_clk_sel(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_cksel_psram(value);
}

__FLASH_BOOT_CODE void sys_hal_psram_set_clkdiv(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_psram(value);
}

__FLASH_BOOT_CODE void sys_hal_psram_psldo_vsel(uint32_t value)
{
	sys_ana_ll_set_ana_reg4_vpsramsel(value);// 1.8V + step 50mv
}

__FLASH_BOOT_CODE void sys_hal_psram_psldo_vset(uint32_t output_voltage, uint32_t is_add_200mv)
{
	// psldo_swb=1, vpsramsel=3 - 1.80v
	// psldo_swb=1, vpsramsel=2 - 1.85v
	// psldo_swb=1, vpsramsel=1 - 1.90v
	// psldo_swb=1, vpsramsel=0 - 1.95v
	// psldo_swb=0, vpsramsel=* - 3.00v
	sys_ana_ll_set_ana_reg4_swb(output_voltage); //1-1.8v, 0-3.0v
	sys_ana_ll_set_ana_reg4_vpsramsel(is_add_200mv);// 1.8V + step 50mv
}

__FLASH_BOOT_CODE void sys_hal_psram_psram_disckg(uint32_t value)
{
	// not support
}

/**  psram End **/

/* REG_0x03:cpu_storage_connect_op_select->flash_sel:0: normal flash operation 1:flash download by spi,R/W,0x3[9]*/
uint32_t sys_hal_get_cpu_storage_connect_op_select_flash_sel(void)
{
    return sys_ll_get_cpu_storage_connect_op_select_flash_sel();
}

void sys_hal_set_cpu_storage_connect_op_select_flash_sel(uint32_t value)
{
    sys_ll_set_cpu_storage_connect_op_select_flash_sel(value);
}

/** Ethernet start **/
#ifdef CONFIG_ETH
void sys_hal_enable_eth_int(uint32_t value)
{
}
#endif
/** Ethernet End**/

/**  Misc Start **/
//Misc
/**  Misc End **/

void sys_hal_set_ana_trxt_tst_enable(uint32_t value)
{
}

void sys_hal_set_ana_scal_en(uint32_t value)
{
}

void sys_hal_set_ana_gadc_buf_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_gadc_cmp_ictrl(uint32_t value)
{
}

void sys_hal_set_ana_pwd_gadc_buf(uint32_t value)
{
}

void sys_hal_set_ana_hres_sel0v9(uint32_t value)
{
}

void sys_hal_set_ana_vref_sel(uint32_t value)
{
}

void sys_hal_set_ana_cb_cal_manu(uint32_t value)
{
    sys_ana_ll_set_ana_reg5_bcal_en(value);
}

void sys_hal_set_ana_cb_cal_trig(uint32_t value)
{
    sys_ana_ll_set_ana_reg5_bcal_start(value);
}

void sys_hal_set_ana_vlsel_ldodig(uint32_t value)
{
}

void sys_hal_set_ana_vhsel_ldodig(uint32_t value)
{
}

void sys_hal_set_sdio_clk_en(uint32_t value)
{
	sys_ll_set_cpu_device_clk_enable_sdio_cken(value);
}

void sys_hal_set_cpu0_sdio_int_en(uint32_t value)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_sdio_int_en(value);
}

void sys_hal_set_sdio_clk_div(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode2_ckdiv_sdio(value);
}

uint32_t sys_hal_get_sdio_clk_div()
{
	return sys_ll_get_cpu_clk_div_mode2_ckdiv_sdio();
}

