Samsung/TizenRT/os/board/bk7239n/src/middleware/soc/bk7239n/hal/sys_hal.c
	/* clk_divd 120MHz,
	 * 1, the core clock is depended on CONFIG_CPU_FREQ_HZ and configSYSTICK_CLOCK_HZ.
	 *    Pay attention to bk_pm_module_vote_cpu_freq,and the routine will switch core
	 *    clock;
	 * 2, sysTick module's clock source is processor clock now;
	 */
	if((coresel != PM_CLKSEL_CORE_480M) && (corediv != 0x3))//160M
	{
		sys_hal_mclk_div_set(480000000/CONFIG_CPU_FREQ_HZ - 1);
		sys_hal_delay(10000);

		sys_hal_mclk_mux_set(PM_CLKSEL_CORE_480M);/*clock source: DPLL, 480M*/
	}
	timer_hal_us_init();

	/*increase the anaspi_freq, current it only use for lpo: external 32k, 26m/32k*/
	//if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		sys_ll_set_cpu_anaspi_freq_anaspi_freq(0x2);//ana_sck = bus_clk/((divd+1)*2))
	}
}
__FLASH_BOOT_CODE static void sys_hal_pwd_rosc(void)
{
	volatile uint32_t count = PM_POWER_ON_ROSC_STABILITY_TIME;
	/*when the lpo src select external 32k or 26m/32k, it disable the rosc;because make sure write the analog register successfully*/
	if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		if(aon_pmu_ll_get_r41_lpo_config() == PM_LPO_SRC_ROSC)
		{
			aon_pmu_ll_set_r41_lpo_config(PM_LPO_SRC_DIVD);
		}

		if(sys_ana_ll_get_ana_reg5_pwd_rosc_spi() != 0x1)
		{
			sys_ana_ll_set_ana_reg5_pwd_rosc_spi(0x1);
		}
	}
	else
	{
		if(sys_ana_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
		{
			sys_ana_ll_set_ana_reg5_pwd_rosc_spi(0x0);

			while(count--)//delay time for stability when power on rosc
			{
			}
		}
	}
}

//TODO the module owner can put the sys init to better place
__FLASH_BOOT_CODE void sys_hal_early_init(void)
{
	/*power down rosc, temp modify*/
	sys_hal_pwd_rosc();

	uint32_t chip_id = aon_pmu_hal_get_chipid();

	uint32_t val = sys_hal_analog_get(ANALOG_REG5);
	// power up dpll first
	val |= (0x1 << 5);
	sys_hal_analog_set(ANALOG_REG5,val);
#if !CONFIG_XIP_KERNEL
	val = sys_hal_analog_get(ANALOG_REG4);
#endif

	sys_hal_analog_set(ANALOG_REG0, 0x19219780);//liupeng202400807:<9:7>=7;zhiyin20250429<11>=0 enable dpll_unlock flag;zhiyin20250604<29:28>=1
	sys_hal_analog_set(ANALOG_REG1, 0xC02EFA00);
	sys_hal_analog_set(ANALOG_REG2, 0x0600D436);
	sys_hal_analog_set(ANALOG_REG3, 0xFDFC0BC8);//tenglong20240806:high psrr as default, low when sleep;ronghui20250520<27>=1 avoid dpll unlock detect issue when high temp
#if defined(CONFIG_XIP_KERNEL) && (CONFIG_XIP_KERNEL == 1)
	sys_hal_analog_set(ANALOG_REG4, 0x40000000);
#else
	sys_hal_analog_set(ANALOG_REG4, val & 0xF0000000);
#endif
	sys_hal_analog_set(ANALOG_REG5, 0x8407AF60);//liupeng20250514:hp for tx
	sys_hal_analog_set(ANALOG_REG6, 0x80088100);//liupeng20250427
	sys_hal_analog_set(ANALOG_REG7, 0x57E697C6);//xinyuan20250611:<9:6>=F for better EVM
	sys_hal_analog_set(ANALOG_REG8, 0xF87C72E4);//ronghui20250519:<31:30>=3(0.9V), avoid write analog failure

	/**
	 * attention:
	 * SPI latch must be enable before ana_reg[8~13] modification
	 * and don't forget disable it after that.
	 */
	sys_ana_ll_set_ana_reg8_spi_latch1v(1);
#if defined(CONFIG_AON_RTC_KEEP_TIME_SUPPORT)
	sys_hal_analog_set(ANALOG_REG9, 0xB555B327);//tenglong20240805:2M buck for EVM
#else
	sys_hal_analog_set(ANALOG_REG9, 0xB5553327);//tenglong20240805:2M buck for EVM
#endif
	sys_hal_analog_set(ANALOG_REG10, 0xF7EEB89A);
	sys_hal_analog_set(ANALOG_REG11, 0x00000000);
	sys_hal_analog_set(ANALOG_REG12, 0x00100000);
	sys_hal_analog_set(ANALOG_REG13, 0x00080000);
	sys_hal_analog_set(ANALOG_REG14, 0x00A80008);
	sys_hal_analog_set(ANALOG_REG15, 0x528809F6);
	sys_ana_ll_set_ana_reg8_spi_latch1v(0);

	/*early init cpu flash time*/
	sys_hal_dpll_cpu_flash_time_early_init(chip_id);

	//TODO: should be done with wifi_init->bk_pm_clock_ctrl
	sys_hal_clk_pwr_ctrl(CLK_PWR_ID_RF, CLK_PWR_CTRL_PWR_UP);
}

void sys_hal_set_scr_clk(uint32_t value)
{
}

/**  SCR End  */
